[{"name": "Busan", "url": "/Busan-Surf-Report/4542/", "country": {"iso": "kr"}, "region": {"_id": 106}, "lon": 129.163, "hasNetcam": false, "lat": 35.1587, "_id": 4542, "description": ""}, {"name": "Jeju Island", "url": "/Jeju-Island-Surf-Report/4541/", "country": {"iso": "kr"}, "region": {"_id": 106}, "lon": 126.4102, "hasNetcam": false, "lat": 33.2449, "_id": 4541, "description": ""}, {"name": "Jukdo", "url": "/Jukdo-Surf-Report/4543/", "country": {"iso": "kr"}, "region": {"_id": 106}, "lon": 128.6603, "hasNetcam": false, "lat": 38.0942, "_id": 4543, "description": ""}, {"name": "Majon Hotel Beach", "url": "/Majon-Hotel-Beach-Surf-Report/4576/", "country": {"iso": "pkr"}, "region": {"_id": 106}, "lon": 127.6694, "hasNetcam": false, "lat": 39.8186, "_id": 4576, "description": "Located just east of Hamhung (DPRKs second biggest city after Pyongyang), this private beach lays just in front of the Majon Hotel (a 5-star Sheraton). The beach benefits from the frequent easterly swells that approach the coast of North Korea. The emerald bay offers two different surf locations: an easy beach break-peak and a juicy sand-bottom point-break. This is the home of Majon Surf School and where we do most of our free-surfing and lessons. \r\n\r\nCRYSTALS was named after local surfer girl, Kim Jin Ok (meaning “True Crystals”), and is a choreographic, fast point-break peeling under an imposing ferrous headland, on the southern corner of Majon Bay. It activates with swell from NE, E and SE, starting from 0.8m on forecasts. The wave offers a shifty, punchy takeoff just under the cliff, followed by an easy second section that leads to a zippy inside, often connecting all the way to the shore for a total ride of over 70-100m. The bottom is made of compact, thick-grain sand, with some scattered rocks that do not constitute a hazard. The point activates at high tide, and can be surfed with onshore winds up to 8-10knt. The spot offers a deep water channel (with a moderate outgoing rip) just aside of the break for easy access to take off zone. Visible from your room window at Majon Hotel, this is the highest quality wave discovered so far in North Korea. \r\n\r\nFLOWERS was named after local surfer girl, Kim Kook Hwa (meaning “National Flower”), and is a mellow sand bottom peak right in front of the beach house of the Majon Surf School. The slowly decreasing bathymetry here makes this sandbank a good long-boarding and SUP wave and a perfect venue for surf lessons. Instructors can safely operate in belly to chest high water, comfortably helping students with assisted take offs, 40-70m from the shore.  Flowers activates on minimal swells (from 0.4m up on forecasts), especially at low tide when it produces a clean A-frame peak, with 50m long lefts and rights. With bigger swells the spot turns into a high-performance beach break, with rippable walls and steep sections.\r\n"}, {"name": "Pioneers", "url": "/Pioneers-Surf-Report/4577/", "country": {"iso": "pkr"}, "region": {"_id": 106}, "lon": 127.6806, "hasNetcam": false, "lat": 39.8256, "_id": 4577, "description": "“Pioneers” was named by Kim Wang Sun, DPRK’s first official surfer. This was the first break surfed in the DPRK and is located in the next bay north of Majon Beach. The compact-sand breach break offers punchy lefts and rights depending on size and swell direction. Breaks on NE, E and SE swells from 0.5m up.  Good for beginners, longboarding and SUP’s on smaller days. Good for shortboarding and bodyboarding on larger days when it gets steep and hollow, connecting all the way to the inside. "}, {"name": "Sijung", "url": "/Sijung-Surf-Report/4582/", "country": {"iso": "pkr"}, "region": {"_id": 106}, "lon": 127.8375, "hasNetcam": false, "lat": 39.0103, "_id": 4582, "description": "Located 20min drive south of Wonsan, this pristine beach is exposed to easterly and northeasterly swells. The slowly decreasing sand bottom makes it an easy and safe surf and SUP venue. One promising surf spot can be found just north of the car park, activating on solid (1m or bigger) easterly swells. When flat, Sijung turns into a great SUP destination, with picturesque offshore islets and a beautiful fresh water lake to be explored"}]